Revit 2027 API
ViewNode.LevelOfDetail Property
 The level of detail the view is going to be rendered at.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LevelOfDetail { get; set; }
Public Property LevelOfDetail As Integer
	Get
	Set
public:
property int LevelOfDetail {
	int get ();
	void set (int value);
}
member LevelOfDetail : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The level of detail is not in valid range. It must be a number between -1 and 15, all inclusive.
Remarks
 The value is an integer number in range of [0,15] (inclusive), or a value {-1}. If the value is positive, Revit will use the suggested level of detail when tessellating faces; otherwise it will use its default algorithm, which is based on output resolution.
 If an explicit level of detail is requested (i.e. a positive value), using a value close to the middle of the valid range yields a very reasonable tessellation. Revit uses level 8 as its 'normal' LoD.
See Also
Reference
ViewNode Class
Autodesk.Revit.DB Namespace